Revit 2026 API

# AdvancedLayeredLayeredNormal Property

---

The property labeled "Image" from the "AdvancedLayered" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string LayeredNormal { get; }
```
```vb
Public Shared ReadOnly Property LayeredNormal As String
	Get
```
```cpp
public:
static property String^ LayeredNormal {
	String^ get ();
}
```
```fsharp
static member LayeredNormal : string with get
```

#### Property Value

String

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

#### Reference

AdvancedLayered Class

Autodesk.Revit.DB.Visual Namespace